// Напишите програму, которая принимает на
// вход трёхзначное число и удаляет втору.
// цифру этого числа.
// Примеры :
// a = 256 => 25
// a = 891 >= 81


// Console.Write("Введите трёхзначное число : ");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num > 99 && num <1000)     // "&&" используется для условия И; "||" исмпользуется для условия ИЛИ
// {
//     int num1 = num / 100; // 2
//     int num2 = num % 10; // 6
//     int result = num1 * 10 + num2;
//     System.Console.WriteLine(result);
// }
// else
// {
//     System.Console.WriteLine("Вы ввели не трёхзначное число");
// }

// Напишите программу, которая принимает на выход
// трёхзначное число и возводит вторую цифру этого
// числа в степень, равную третьей цифре.
// Примеры :
// 487 => 8^7 = 2 097 152
// 254 =Ю 5^4 = 625
// 617 => 1^7 = 1

// int num = new Random().Next(100,1000); // если нужно например 3-х значное число то диапозон указываем на 1-цу больше!!!
// System.Console.WriteLine(num);

// int num2 = num / 10 % 10; 
// int num3 = num % 10;
// int result = 1;

// while (num3>0)
// {
//     result = result * num2;
//     num3 = num3 - 1;
// }
// System.Console.WriteLine(result);


// Напишите программу, которая будет принмать на
// вход два числа и выводить, является ли первое число
// кратным второму. Если первое число некратно
// второму, то программа выводит отстаток от деления.
// Примеры :
// 14, 5 =>нет, 4
// 16, 8 => да
// 4, 3 => нет, 1

// Console.Write("Введите первое число : ");
// int num1 = Convert.ToInt32(Console.ReadLine());
// Console.Write("Введите второе число : ");
// int num2 = Convert.ToInt32(Console.ReadLine());

// if (num1 % num2 == 0)
// {
//     Console.WriteLine("Да");
// }
// else
// {
//     Console.WriteLine("нет, " + num1 % num2);
// }


// Напишите программу, которая выводит третью с
// конца цифру заданного числа или сообщает, что
// третьей цифры нет.
// Примеры :
// 456 => 6
// 7812 => 8
// 91 => Третьей цифры нет

// int num = new Random().Next(100,10000); // 4879
// System.Console.WriteLine(num);

// if (num < 100) //-
// {
//     System.Console.WriteLine("Третьей цифры нет");
// }
// else // +
// {
//     while (num >= 1000) // +
//     {
//         num = num /10;
//     }
//     System.Console.WriteLine(num % 10); // 487 % 10 = 7
// }